# GetInsulationSpecificationAbbreviation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetInsulationSpecificationAbbreviation Method
FabricationConfiguration Class See Also
---
Gets insulation specification abbreviation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string GetInsulationSpecificationAbbreviation(
	int insulationSpecificationId
)
```

Visual Basic
---
```text
Public Function GetInsulationSpecificationAbbreviation ( _
	insulationSpecificationId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetInsulationSpecificationAbbreviation(
	int insulationSpecificationId
)
```

# ### Parameters
insulationSpecificationId
    Type: System..::..Int32 The insulation specification identifier.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace